In [109]:
import numpy as np
import pandas as pd

In [110]:
log = pd.read_csv('log.xls', header=None, sep=',')
log.columns = ['user_id', 'time', 'bet', 'win'] 
log.head()

                            user_id                  time  bet  win
0  Запись пользователя № - user_919  [2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  [2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903  [2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954  [2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954  [2019-01-01 21:31:18  NaN  NaN

## 12.1 Пропущенные значения

In [111]:
log['time'].isna().sum()

15

In [112]:
log2 = log

In [113]:
# Drop the columns where at least one element is missing.
log2.dropna(axis='columns')

                              user_id
0    Запись пользователя № - user_919
1    Запись пользователя № - user_973
2    Запись пользователя № - user_903
3    Запись пользователя № - user_954
4    Запись пользователя № - user_954
..                                ...
995  Запись пользователя № - user_984
996                            #error
997                            #error
998                            #error
999                            #error

[1000 rows x 1 columns]

In [114]:
log2 = log
#Drop the rows where at least one element is missing.
log2.dropna()

,user_id,time,bet,win
14,Запись пользователя № - user_917,[2019-01-02 8:57:36,145732.0,1987653.0
29,Запись пользователя № - user_942,[2019-01-04 13:59:42,1678321.0,9876543.0
151,Запись пользователя № - user_982,[2019-01-16 21:54:22,100.0,4749.0
189,Запись пользователя № - user_964,[2019-01-21 18:34:44,200.0,4667.0
205,Запись пользователя № - user_931,[2019-01-22 5:26:59,300.0,4319.0
...,...,...,...,...
967,Запись пользователя № - user_975,[2019-04-19 22:25:15,1000.0,6108.0
971,Запись пользователя № - user_912,[2019-04-20 10:35:49,10554.0,31799.0
972,Запись пользователя № - user_926,[2019-04-20 10:35:50,10354.0,30244.0
976,Запись пользователя № - user_970,[2019-04-20 10:35:54,10354.0,30691.0
991,Запись пользователя № - user_965,[2019-04-20 12:55:41,800.0,6927.0

In [115]:
log2 = log
#
log2.dropna(subset=['user_id', 'time'])

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

## 12.2. Дубли

In [116]:
df =  log.iloc[:, :2].copy() 
df.drop_duplicates()

                              user_id                  time
0    Запись пользователя № - user_919  [2019-01-01 14:06:51
1    Запись пользователя № - user_973  [2019-01-01 14:51:16
2    Запись пользователя № - user_903  [2019-01-01 16:31:16
3    Запись пользователя № - user_954  [2019-01-01 17:17:51
4    Запись пользователя № - user_954  [2019-01-01 21:31:18
..                                ...                   ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41
992  Запись пользователя № - user_967  [2019-04-20 14:59:36
993  Запись пользователя № - user_973  [2019-04-20 17:09:56
994  Запись пользователя № - user_977  [2019-04-20 18:10:07
995  Запись пользователя № - user_984   [2019-04-20 9:59:58

[986 rows x 2 columns]

## 12.3 Преобразование к datetime

In [117]:
# Remove '[' from column time
log2 = log.copy()
log2.time = log2.time.apply(lambda s: s if pd.isna(s) else str(s).replace('[','')  )
log2.head()

                            user_id                 time  bet  win
0  Запись пользователя № - user_919  2019-01-01 14:06:51  NaN  NaN
1  Запись пользователя № - user_973  2019-01-01 14:51:16  NaN  NaN
2  Запись пользователя № - user_903  2019-01-01 16:31:16  NaN  NaN
3  Запись пользователя № - user_954  2019-01-01 17:17:51  NaN  NaN
4  Запись пользователя № - user_954  2019-01-01 21:31:18  NaN  NaN

In [118]:
pd.to_datetime(log2.time, format='%Y-%m-%d').max()

Timestamp('2019-04-20 18:10:07')

In [119]:
# Задание 2

log2 = log.copy()
log2 = log2.dropna()  
#log2['time'] = log2['time'].apply(lambda x: x[1:])  
log2.time = log2.time.apply(lambda s: s if pd.isna(s) else str(s).replace('[','')  )
log2['time'] = pd.to_datetime(log2.time, format='%Y-%m-%d %H:%M:%S')  
log2.time = log2.time.apply(lambda x: x.minute)
log2['time'].head()

14     57
29     59
151    54
189    34
205    26
Name: time, dtype: int64

## 12.4 Извлечение признаков времени

In [120]:
# Задание 1

log2 = log.copy()
log2 = log2.dropna()  
#log2['time'] = log2['time'].apply(lambda x: x[1:])  
log2.time = log2.time.apply(lambda s: s if pd.isna(s) else str(s).replace('[','')  )
log2['time'] = pd.to_datetime(log2.time, format='%Y-%m-%d %H:%M:%S')  
temp = log2.time.dt.minute
temp.value_counts()

36    7
57    5
44    5
18    5
35    4
40    4
25    4
2     4
48    4
8     4
1     4
55    4
34    4
16    3
6     3
23    3
15    3
31    3
0     3
11    3
38    3
43    3
46    2
10    2
54    2
52    2
17    2
50    2
9     2
20    2
49    2
45    2
12    2
5     2
26    2
58    2
29    2
42    2
33    2
3     1
4     1
59    1
13    1
14    1
19    1
21    1
22    1
24    1
37    1
39    1
47    1
53    1
27    1
Name: time, dtype: int64

In [121]:
# Задание 2
log2 = log.copy()
#log2 = log2.dropna()  
log2.time = log2.time.apply(lambda s: s if pd.isna(s) else str(s).replace('[','')  )
log2['time'] = pd.to_datetime(log2.time, format='%Y-%m-%d %H:%M:%S')  
temp = log2.time.dt.month
temp.value_counts() 
#temp

1.0    292
3.0    264
2.0    259
4.0    170
Name: time, dtype: int64

In [122]:
# Задание 3
log2 = log.copy()
#log2 = log2.dropna()  
log2.time = log2.time.apply(lambda s: s if pd.isna(s) else str(s).replace('[','')  )
log2['time'] = pd.to_datetime(log2.time, format='%Y-%m-%d %H:%M:%S')  
temp = log2.time.dt.dayofweek
temp2 = temp.value_counts() 
temp2[[5,6]].sum()

283

In [123]:
def day_time(x):
    if x in range(0, 6):
        return 'nigth'
    elif x in range(6, 12):
        return 'morning'
    elif x in range(12, 18):
        return 'day'
    else:
        return 'evening'

In [124]:
# Задание 4

log2 = log.copy()
log2.time = log2.time.apply(lambda s: s if pd.isna(s) else str(s).replace('[','')  )
log2 = log2.dropna(subset=['time'])
log2['time'] = pd.to_datetime(log2.time, format='%Y-%m-%d %H:%M:%S')  
temp = log2.time.dt.hour
temp.apply(day_time).value_counts()

nigth      265
morning    253
day        240
evening    227
Name: time, dtype: int64

In [125]:
day_time(10)

'morning'

In [126]:
# Задание 5

log2['hour'] = log2.time.apply(lambda x: x.hour)

## 12.5 Снова смотрим на пропуски

In [170]:
log2 = log.copy()
log2.bet = log2['bet'].fillna(0)
#log2.bet.value_counts()

In [153]:
def fillna_win(row):
    if not pd.isna(row['win']):
        return row['win']
    elif pd.isna(row['win']) and (pd.isna(row['bet']) or row['bet'] == 0):
        return 0
    else:
        return -row['bet']

In [171]:
# Применяем функцию  
new_win = log2.apply(lambda row: fillna_win(row), axis=1)  

# Заменяем старый столбец с пропусками на новый без пропусков  
log2['win'] = new_win

In [130]:
# Задание 2

log2.win[log2.win < 0].count()

347

## 12.6 Есть ли смысл играть?

In [174]:
def net_win(row):
    res = 0
    if (row['win'] >= 0):
        res = (row['win'] - row['bet'])
    return res

In [175]:
# Задание 1

log2['net'] = log2.apply(lambda row: net_win(row), axis=1) 
log2

,user_id,time,bet,win,net
0,Запись пользователя № - user_919,[2019-01-01 14:06:51,0.0,0.0,0.0
1,Запись пользователя № - user_973,[2019-01-01 14:51:16,0.0,0.0,0.0
2,Запись пользователя № - user_903,[2019-01-01 16:31:16,0.0,0.0,0.0
3,Запись пользователя № - user_954,[2019-01-01 17:17:51,0.0,0.0,0.0
4,Запись пользователя № - user_954,[2019-01-01 21:31:18,0.0,0.0,0.0
...,...,...,...,...,...
995,Запись пользователя № - user_984,[2019-04-20 9:59:58,9754.0,-9754.0,0.0
996,#error,NaN,10054.0,29265.0,19211.0
997,#error,NaN,10454.0,-10454.0,0.0
998,#error,NaN,1000.0,-1000.0,0.0
999,#error,NaN,10754.0,-10754.0,0.0

In [165]:
log2.net[log2.net > 0].count()

138

In [176]:
# Задание 2

log2.net[log2.net > 0].mean()

80253.33333333333

In [177]:
# Задание 3

log2.net[log2.net > 0].median()

5347.0

In [183]:
# Задание 4
# Как можно посчитать среднее значение для столбца bet, не учитывая при подсчете пропуски?

log.bet.sum() / log.bet.dropna().shape[0]
log['bet'].dropna().mean()
log.bet.mean()
np.mean(log.bet)

6785.738144329897

## 12.7 Сколько можно выиграть/проиграть?

In [197]:
log2 = log.copy()
log2.bet = log2['bet'].fillna(0)
log2.win = log2['win'].fillna(0)
log2['net'] = log2['win'] - log2['bet']
log2

,user_id,time,bet,win,net
0,Запись пользователя № - user_919,[2019-01-01 14:06:51,0.0,0.0,0.0
1,Запись пользователя № - user_973,[2019-01-01 14:51:16,0.0,0.0,0.0
2,Запись пользователя № - user_903,[2019-01-01 16:31:16,0.0,0.0,0.0
3,Запись пользователя № - user_954,[2019-01-01 17:17:51,0.0,0.0,0.0
4,Запись пользователя № - user_954,[2019-01-01 21:31:18,0.0,0.0,0.0
...,...,...,...,...,...
995,Запись пользователя № - user_984,[2019-04-20 9:59:58,9754.0,0.0,-9754.0
996,#error,NaN,10054.0,29265.0,19211.0
997,#error,NaN,10454.0,0.0,-10454.0
998,#error,NaN,1000.0,0.0,-1000.0
999,#error,NaN,10754.0,0.0,-10754.0

In [198]:
# Задание 1

log2.bet[log2.bet > 0].count() / len(log2.bet)

0.485

In [199]:
# Задание 2

log2.bet[log2.bet > 0].mean()

6785.738144329897

In [202]:
# Задание 3

log2.net[log2.bet > 0].mean()

20421.892783505155

In [203]:
# Задание 4

log2.net[log2.net < 0].mean()

-3372.743515850144

In [206]:
# Задание 5

log2.net[log2.net < 0].count() / len(log2.net)
log2.net[log2.net > 0].count() / len(log2.net)

0.138

In [210]:
# Задание 6

min_bet = log2.bet[log2.bet > 0].min()
min_bet_amount = round(log2.bet[log2.bet == min_bet].count())

48

## 12.8 Повторение merge/groupby

In [213]:
us = pd.read_csv('users.xls', encoding='KOI8-R', sep='\t')
us.columns = ['user_id', 'email', 'geo'] 
# Приведем признак user_id к одному формату в обоих датасетах  
us.user_id = us.user_id.apply(lambda x: x.lower())  
us.head()

    user_id                email        geo
0  user_943  Accumanst@gmail.com     Ижевск
1  user_908    Advismowr@mail.ru     Ижевск
2  user_962      Anachso@ukr.net  Краснодар
3  user_973     Antecia@inbox.ru      Пермь
4  user_902   Balliaryva@ukr.net        NaN

In [282]:
# Избавимся от ошибок в user_id  
log2 = log2[log2.user_id != '#error']  
log2.user_id = log2.user_id.str.split(' - ').apply(lambda x: x[1]) 
log2.time = log2.time.apply(lambda s: s if pd.isna(s) else str(s).replace('[','')  )
log2['time'] = pd.to_datetime(log2.time, format='%Y-%m-%d %H:%M:%S')  
log2

      user_id                time      bet     win      net
0    user_919 2019-01-01 14:06:51      0.0     0.0      0.0
1    user_973 2019-01-01 14:51:16      0.0     0.0      0.0
2    user_903 2019-01-01 16:31:16      0.0     0.0      0.0
3    user_954 2019-01-01 17:17:51      0.0     0.0      0.0
4    user_954 2019-01-01 21:31:18      0.0     0.0      0.0
..        ...                 ...      ...     ...      ...
991  user_965 2019-04-20 12:55:41    800.0  6927.0   6127.0
992  user_967 2019-04-20 14:59:36  10154.0     0.0 -10154.0
993  user_973 2019-04-20 17:09:56  10254.0     0.0 -10254.0
994  user_977 2019-04-20 18:10:07  10354.0     0.0 -10354.0
995  user_984 2019-04-20 09:59:58   9754.0     0.0  -9754.0

[985 rows x 5 columns]

In [283]:
df = pd.merge(us, log2, on='user_id')  
df

,user_id,email,geo,time,bet,win,net
0,user_943,Accumanst@gmail.com,Ижевск,2019-01-06 21:06:57,0.0,0.0,0.0
1,user_943,Accumanst@gmail.com,Ижевск,2019-01-10 12:16:22,100.0,0.0,-100.0
2,user_943,Accumanst@gmail.com,Ижевск,2019-01-27 01:18:47,100.0,0.0,-100.0
3,user_943,Accumanst@gmail.com,Ижевск,2019-02-10 11:09:24,100.0,5456.0,5356.0
4,user_943,Accumanst@gmail.com,Ижевск,2019-02-12 15:09:38,300.0,5245.0,4945.0
...,...,...,...,...,...,...,...
970,user_965,Visuareda@yahoo.com,Воронеж,2019-04-20 12:55:41,800.0,6927.0,6127.0
971,user_921,Aavast@ya.ru,Ижевск,2019-01-07 01:05:59,0.0,0.0,0.0
972,user_921,Aavast@ya.ru,Ижевск,2019-02-05 14:08:57,0.0,0.0,0.0
973,user_921,Aavast@ya.ru,Ижевск,2019-02-09 23:20:21,400.0,6067.0,5667.0
974,user_921,Aavast@ya.ru,Ижевск,2019-02-10 17:53:37,900.0,0.0,-900.0

In [284]:
df.groupby('user_id').win.median().median()

0.0

## 12.9 Анализ по пользователям

In [285]:
# Задание 1

df.groupby('user_id').net.sum().median()

1986.0

In [286]:
# Задание 2

usid = df.user_id[df.bet > 0].unique()
tdf = df[df.user_id.isin(usid)]
tdf[tdf.bet ==0].groupby('user_id').bet.count().mean()

5.05

In [319]:
# Задание 3

def dt_diff(row):
    return pd.Timedelta(row.time_x - row.time_y)

In [321]:
fbet = tdf[tdf.bet > 0].groupby('user_id').time.min()
fvis = tdf[tdf.bet ==0].groupby('user_id').time.min()
temp = pd.merge(fbet, fvis, on='user_id')
temp.apply(lambda row: dt_diff(row), axis=1).mean()

Timedelta('46 days 06:54:48')

## 12.10 Анализ по городам

In [328]:
# Задание 1
df.groupby('geo').win.sum().sort_values(ascending=False)

geo
Москва             11959741.0
Воронеж              184338.0
Санкт-Петербург      151007.0
Казань                97806.0
Ярославль             97441.0
Ижевск                84895.0
Красноярск            84767.0
Арзангелтск           74375.0
Пермь                 67734.0
Хабаровск             65459.0
Краснодар             62718.0
Ставрополь            46003.0
Екатеринбург          36682.0
Тюмень                 4701.0
Name: win, dtype: float64

In [333]:
# Задание 2

df[df.bet > 0].groupby('geo').bet.mean().max() / df[df.bet > 0].groupby('geo').bet.mean().min()

127.81602335164835

In [334]:
# Задание 3

df.groupby('geo').user_id.count()

geo
Арзангелтск         96
Воронеж             88
Екатеринбург        49
Ижевск              61
Казань              66
Краснодар           86
Красноярск          56
Москва              61
Пермь               55
Санкт-Петербург    115
Ставрополь          36
Тюмень              32
Хабаровск           60
Ярославль           89
Name: user_id, dtype: int64

In [341]:
df.time.dt.month

0      1
1      1
2      1
3      2
4      2
      ..
970    4
971    1
972    2
973    2
974    2
Name: time, Length: 975, dtype: int64